clc  ,clear ,close all 
% 实验二频域特性的计算机辅助分析
% nyquist(num,den,w)    绘制nyquist图，w表示指定频率点
% bode(num,den,w)       绘制bode图，w表示指定频率点

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%   第一个
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
num=[1];
den=[1 0.8 1];
figure(1);
nyquist(num,den)
title('nyquist Plot of G(s)=1/(s^2+0.8s+1)');

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%   第二个
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
num=[25];
den=[1 4 25];
figure(2);
bode(num,den);
title('bode Plot of G(s)=25/(s^2+4s+25)');




